recipes/recipes.org
#+OPTIONS: toc:2

* Introduction
For Eliot, Merry Christmas! This page will be continuously updated, so
check back in every once and a while! A PDF version is also available [[file:recipes.pdf][here]].

* Pantry
** Dashi
*** Ingredients
    - 30 grams dried Kombu
    - 30 grams bonito flakes
    - 2 Liters water
*** Instructions
    Combine water and kombu in a saucepan, and bring to a simmer over
    medium heat. Remove from the heat, then add in the bonito flakes,
    and let sit for 5 minutes. Strian off the kombu and bonito and
    discard. The resulting stock can be stored in the fridge for up to
    a week.
* Snacks
** Sourdough Starter Scallion Pancakes
   - Leftover sourdough starter
   - Scallions
   - Sesame Oil
   - Salt
*** Instructions
   Dice scallions, and add to leftover starter and mix to form a
   batter. Heat a pan on medium heat, and pour batter down to form
   pancakes. Cook as you would a pancake.

   In a small bowl, mix together a bit of sesame oil and salt.
   To serve, dip the pancakes in the sauce.
* Lunch
** Chickpea Wraps
*** Ingredients
    - 1 can chickpeas (15 oz)
    - Mayonnaise (1/3 cup)
    - Sriracha (1.5 Tbsp)
    - Cilantro (2 Tbsp)
    - Lemon Juice (1 Tsp)
    - Salt (1/8 Tsp)
    - Large Flour Tortillas (2)
    - Spinach (2 Cups)
    - Carrot (1)
    - Bell Pepper (1/2)
*** Prep
    - Drain chickpeas
    - Thinly dice carrot into strips
    - Cut bell pepper into strips
*** Instructions
    Add drained chickpeas then add them to a bowl with the mayonnaise,
    sriracha, cilantro, lemon juice, and salt. (You may want to start
    with less sriracha and add more to taste if you are sensitive to
    heat). Mash the chickpeas until they are fairly broken down and
    the dressing ingredients have combined.

    To build the wraps, place the tortillas on a work surface and add
    half of the spinach, carrot sticks, bell pepper, and sriracha
    chickpea salad to each one. Fold the sides in toward the center,
    then roll from the bottom up, like a burrito. Serve immediately or
    refrigerate until ready to eat.
* Dinner
** Chickpeas and Orzo
*** Ingredients
    - 1 can chickpeas (15oz)
    - Orzo (2 servings)
    - Shallot (2)
    - Italian Parsley (5 sprigs)
    - Feta Cheese
    - Olive Oil
*** Prep
    - Dice Parsley
    - Crumble feta cheese
    - Drain and rinse chickpeas
*** Instructions
    Boil water, salt, and cook orzo.

    Saute the shallots until they are translucent and begin
    to brown. Then, add the chickpeas and stir, until they are warmed.
    Then, add the orzo and mix. Remove from heat, and add feta cheese
    to taste. Sprinkle with diced parsley.
** Korean Rice Bowls
*** Ingredients
   - 2 Cups Cooked Rice
   - 2 Tbsp Gochujang
   - 4 Tbsp Soy Sauce
   - 1 Tbsp Rice Vinegar
   - 2 Tbsp Water
   - 4 Large Portobello Mushrooms
   - 1 Yellow Onion
   - 1 Cucumber
   - 1 Carrot
   - 2 green onions
   - Sesame Seeds
