recipes/recipes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-07 Sun 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Reed Mullanix" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3022a23">1. Introduction</a></li>
<li><a href="#orga5869d6">2. Pantry</a>
<ul>
<li><a href="#org6c22923">2.1. Dashi</a></li>
</ul>
</li>
<li><a href="#org9b399f7">3. Snacks</a>
<ul>
<li><a href="#org811a364">3.1. Sourdough Starter Scallion Pancakes</a></li>
</ul>
</li>
<li><a href="#orgc67557d">4. Lunch</a>
<ul>
<li><a href="#orgd74d30d">4.1. Chickpea Wraps</a></li>
</ul>
</li>
<li><a href="#org169026e">5. Dinner</a>
<ul>
<li><a href="#orgc14c3d7">5.1. Chickpeas and Orzo</a></li>
<li><a href="#org7d5e644">5.2. Korean Rice Bowls</a></li>
<li><a href="#orga28db57">5.3. Sesame Noodles</a></li>
<li><a href="#org8dcc556">5.4. Chicken Paprikish</a></li>
<li><a href="#org905ca14">5.5. Oyakodon</a></li>
</ul>
</li>
<li><a href="#org3923ca2">6. Baking</a>
<ul>
<li><a href="#org7db56bd">6.1. Overnight White Bread</a></li>
<li><a href="#org9e89eba">6.2. Sourdough Starter</a></li>
<li><a href="#org780ee2b">6.3. Japanese Milk Bread</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3022a23" class="outline-2">
<h2 id="org3022a23"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
For Eliot, Merry Christmas! This page will be continuously updated, so
check back in every once and a while! A PDF version is also available <a href="recipes.pdf">here</a>.
</p>
</div>
</div>

<div id="outline-container-orga5869d6" class="outline-2">
<h2 id="orga5869d6"><span class="section-number-2">2</span> Pantry</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6c22923" class="outline-3">
<h3 id="org6c22923"><span class="section-number-3">2.1</span> Dashi</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgd30ca63" class="outline-4">
<h4 id="orgd30ca63"><span class="section-number-4">2.1.1</span> Ingredients</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>30 grams dried Kombu</li>
<li>30 grams bonito flakes</li>
<li>2 Liters water</li>
</ul>
</div>
</div>
<div id="outline-container-orgd9534f9" class="outline-4">
<h4 id="orgd9534f9"><span class="section-number-4">2.1.2</span> Instructions</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Combine water and kombu in a saucepan, and bring to a simmer over
medium heat. Remove from the heat, then add in the bonito flakes,
and let sit for 5 minutes. Strian off the kombu and bonito and
discard. The resulting stock can be stored in the fridge for up to
a week.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org9b399f7" class="outline-2">
<h2 id="org9b399f7"><span class="section-number-2">3</span> Snacks</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org811a364" class="outline-3">
<h3 id="org811a364"><span class="section-number-3">3.1</span> Sourdough Starter Scallion Pancakes</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Leftover sourdough starter</li>
<li>Scallions</li>
<li>Sesame Oil</li>
<li>Salt</li>
</ul>
</div>
<div id="outline-container-orgbf22cae" class="outline-4">
<h4 id="orgbf22cae"><span class="section-number-4">3.1.1</span> Instructions</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Dice scallions, and add to leftover starter and mix to form a
batter. Heat a pan on medium heat, and pour batter down to form
pancakes. Cook as you would a pancake.
</p>

<p>
In a small bowl, mix together a bit of sesame oil and salt.
To serve, dip the pancakes in the sauce.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc67557d" class="outline-2">
<h2 id="orgc67557d"><span class="section-number-2">4</span> Lunch</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd74d30d" class="outline-3">
<h3 id="orgd74d30d"><span class="section-number-3">4.1</span> Chickpea Wraps</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org54ca80e" class="outline-4">
<h4 id="org54ca80e"><span class="section-number-4">4.1.1</span> Ingredients</h4>
<div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li>1 can chickpeas (15 oz)</li>
<li>Mayonnaise (1/3 cup)</li>
<li>Sriracha (1.5 Tbsp)</li>
<li>Cilantro (2 Tbsp)</li>
<li>Lemon Juice (1 Tsp)</li>
<li>Salt (1/8 Tsp)</li>
<li>Large Flour Tortillas (2)</li>
<li>Spinach (2 Cups)</li>
<li>Carrot (1)</li>
<li>Bell Pepper (1/2)</li>
</ul>
</div>
</div>
<div id="outline-container-orgba4d5e7" class="outline-4">
<h4 id="orgba4d5e7"><span class="section-number-4">4.1.2</span> Prep</h4>
<div class="outline-text-4" id="text-4-1-2">
<ul class="org-ul">
<li>Drain chickpeas</li>
<li>Thinly dice carrot into strips</li>
<li>Cut bell pepper into strips</li>
</ul>
</div>
</div>
<div id="outline-container-org8dacb6f" class="outline-4">
<h4 id="org8dacb6f"><span class="section-number-4">4.1.3</span> Instructions</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
Add drained chickpeas then add them to a bowl with the mayonnaise,
sriracha, cilantro, lemon juice, and salt. (You may want to start
with less sriracha and add more to taste if you are sensitive to
heat). Mash the chickpeas until they are fairly broken down and
the dressing ingredients have combined.
</p>

<p>
To build the wraps, place the tortillas on a work surface and add
half of the spinach, carrot sticks, bell pepper, and sriracha
chickpea salad to each one. Fold the sides in toward the center,
then roll from the bottom up, like a burrito. Serve immediately or
refrigerate until ready to eat.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org169026e" class="outline-2">
<h2 id="org169026e"><span class="section-number-2">5</span> Dinner</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgc14c3d7" class="outline-3">
<h3 id="orgc14c3d7"><span class="section-number-3">5.1</span> Chickpeas and Orzo</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org3625b7f" class="outline-4">
<h4 id="org3625b7f"><span class="section-number-4">5.1.1</span> Ingredients</h4>
<div class="outline-text-4" id="text-5-1-1">
<ul class="org-ul">
<li>1 can chickpeas (15oz)</li>
<li>Orzo (2 servings)</li>
<li>Shallot (2)</li>
<li>Italian Parsley (5 sprigs)</li>
<li>Feta Cheese</li>
<li>Olive Oil</li>
</ul>
</div>
</div>
<div id="outline-container-orgabd0798" class="outline-4">
<h4 id="orgabd0798"><span class="section-number-4">5.1.2</span> Prep</h4>
<div class="outline-text-4" id="text-5-1-2">
<ul class="org-ul">
<li>Dice Parsley</li>
<li>Crumble feta cheese</li>
<li>Drain and rinse chickpeas</li>
</ul>
</div>
</div>
<div id="outline-container-org88560d4" class="outline-4">
<h4 id="org88560d4"><span class="section-number-4">5.1.3</span> Instructions</h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
Boil water, salt, and cook orzo.
</p>

<p>
Saute the shallots until they are translucent and begin
to brown. Then, add the chickpeas and stir, until they are warmed.
Then, add the orzo and mix. Remove from heat, and add feta cheese
to taste. Sprinkle with diced parsley.
</p>
</div>
</div>
</div>
<div id="outline-container-org7d5e644" class="outline-3">
<h3 id="org7d5e644"><span class="section-number-3">5.2</span> Korean Rice Bowls</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-orgbba5d45" class="outline-4">
<h4 id="orgbba5d45"><span class="section-number-4">5.2.1</span> Ingredients</h4>
<div class="outline-text-4" id="text-5-2-1">
<ul class="org-ul">
<li>2 Cups Cooked Rice</li>
<li>2 Tbsp Gochujang</li>
<li>4 Tbsp Soy Sauce</li>
<li>1 Tbsp Rice Vinegar</li>
<li>2 Tbsp Water</li>
<li>4 Large Portobello Mushrooms</li>
<li>1 Yellow Onion</li>
<li>1 Cucumber</li>
<li>1 Carrot</li>
<li>2 green onions</li>
<li>Sesame Seeds</li>
</ul>
</div>
</div>
