recipes/recipes.tex
% Created 2021-02-07 Sun 11:04
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Reed Mullanix}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Reed Mullanix},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4)}, 
 pdflang={English}}
\begin{document}

\setcounter{tocdepth}{2}
\tableofcontents


\section{Introduction}
\label{sec:orgfe8c863}
For Eliot, Merry Christmas! This page will be continuously updated, so
check back in every once and a while! A PDF version is also available

\section{Pantry}
\label{sec:org1e01655}
\subsection{Dashi}
\label{sec:org1e7046f}
\subsubsection{Ingredients}
\label{sec:org6d6f8ff}
\begin{itemize}
\item 30 grams dried Kombu
\item 30 grams bonito flakes
\item 2 Liters water
\end{itemize}
\subsubsection{Instructions}
\label{sec:org599bdcf}
Combine water and kombu in a saucepan, and bring to a simmer over
medium heat. Remove from the heat, then add in the bonito flakes,
and let sit for 5 minutes. Strian off the kombu and bonito and
discard. The resulting stock can be stored in the fridge for up to
a week.
\section{Snacks}
\label{sec:org0588869}
\subsection{Sourdough Starter Scallion Pancakes}
\label{sec:orgcf080ec}
\begin{itemize}
\item Leftover sourdough starter
\item Scallions
\item Sesame Oil
\item Salt
\end{itemize}
\subsubsection{Instructions}
\label{sec:org2acc70f}
Dice scallions, and add to leftover starter and mix to form a
batter. Heat a pan on medium heat, and pour batter down to form
pancakes. Cook as you would a pancake.

In a small bowl, mix together a bit of sesame oil and salt.
To serve, dip the pancakes in the sauce.
\section{Lunch}
\label{sec:org8788c91}
\subsection{Chickpea Wraps}
\label{sec:org0c0c69d}
\subsubsection{Ingredients}
\label{sec:orgad44150}
\begin{itemize}
\item 1 can chickpeas (15 oz)
\item Mayonnaise (1/3 cup)
\item Sriracha (1.5 Tbsp)
\item Cilantro (2 Tbsp)
\item Lemon Juice (1 Tsp)
\item Salt (1/8 Tsp)
\item Large Flour Tortillas (2)
\item Spinach (2 Cups)
\item Carrot (1)
\item Bell Pepper (1/2)
\end{itemize}
\subsubsection{Prep}
\label{sec:orgb85426f}
\begin{itemize}
\item Drain chickpeas
\item Thinly dice carrot into strips
\item Cut bell pepper into strips
\end{itemize}
\subsubsection{Instructions}
\label{sec:org85792ea}
Add drained chickpeas then add them to a bowl with the mayonnaise,
sriracha, cilantro, lemon juice, and salt. (You may want to start
with less sriracha and add more to taste if you are sensitive to
heat). Mash the chickpeas until they are fairly broken down and
the dressing ingredients have combined.

To build the wraps, place the tortillas on a work surface and add
half of the spinach, carrot sticks, bell pepper, and sriracha
chickpea salad to each one. Fold the sides in toward the center,
then roll from the bottom up, like a burrito. Serve immediately or
refrigerate until ready to eat.
\section{Dinner}
\label{sec:org8d31b38}
\subsection{Chickpeas and Orzo}
\label{sec:orgd8e01ae}
\subsubsection{Ingredients}
\label{sec:orgf590341}
\begin{itemize}
\item 1 can chickpeas (15oz)
\item Orzo (2 servings)
\item Shallot (2)
\item Italian Parsley (5 sprigs)
\item Feta Cheese
\item Olive Oil
\end{itemize}
\subsubsection{Prep}
\label{sec:org89fb210}
\begin{itemize}
\item Dice Parsley
\item Crumble feta cheese
\item Drain and rinse chickpeas
\end{itemize}
\subsubsection{Instructions}
\label{sec:orgf1b5a5b}
Boil water, salt, and cook orzo.

Saute the shallots until they are translucent and begin
to brown. Then, add the chickpeas and stir, until they are warmed.
Then, add the orzo and mix. Remove from heat, and add feta cheese
to taste. Sprinkle with diced parsley.
\subsection{Korean Rice Bowls}
\label{sec:org86f9c2a}
\subsubsection{Ingredients}
\label{sec:org0bf96cd}
\begin{itemize}
\item 2 Cups Cooked Rice
\item 2 Tbsp Gochujang
\item 4 Tbsp Soy Sauce
\item 1 Tbsp Rice Vinegar
\item 2 Tbsp Water
\item 4 Large Portobello Mushrooms
\item 1 Yellow Onion
\item 1 Cucumber
\item 1 Carrot
\item 2 green onions
\item Sesame Seeds
\end{itemize}
