recipes/recipes.org
*** Prep
   - Slice Onion
   - Grate Carrot
   - Slice Cucumber on bias
   - Slice Green Onions on bias
   - Slice Mushrooms in half, then crosswise.
*** Instructions
   First, begin by preparing the Mushroom Marinade. Mix together the
   Gochujang, Soy Sauce, Rice Vinegar, and Water. Add mushrooms to marinade.
   Mix till all the mushrooms are coated, and let stand for 10 minutes.

   Mix together 1Tbsp Rice vinegar, 1 Tsp sugar, and a sprinkle of
   salt. Add cucumber and let stand, occasionally mixing.

   Heat pan with a smal amount of oil on medium-high. Add onions and let cook
   until translucent. Add mushrooms and marinade then cook till sauce
   is somewhat reduced, about 7-9 minutes.

   Prepare rice bowls by laying down rice, adding mushroom/onions,
   then cucumbers, then carrots. Sprinkle with green onion and sesame seeds.

** Sesame Noodles
*** Ingredients
  - 4 scallions, whites and greens separated, thinly sliced
  - 1/2 cup vegetable oil
  - 1 tablespoon crushed red pepper flakes
  - 2 teaspoons sesame seeds
  - 2 teaspoons Sichuan pepper, coarsely chopped
  - 12 ounces thin noodles
  - Kosher salt
  - 1/4 cup tahini (sesame seed paste)
  - 1/4 cup unseasoned rice vinegar
  - 3 tablespoons soy sauce
  - 2 teaspoons toasted sesame oil
  - 1 teaspoon sugar
*** Instructions
    Cook scallion whites, vegetable oil, red pepper flakes, sesame
    seeds, and pepper in a small saucepan over low heat, stirring
    occasionally, until oil is sizzling and scallions are golden
    brown, 12–15 minutes; let chili oil cool in saucepan.

    Meanwhile, cook noodles in a large pot of salted boiling water
    until al dente; drain. Rinse under cold water and drain well.

    Whisk tahini, vinegar, soy sauce, sesame oil, sugar, and 2–3
    tablespoons chili oil (depending on desired heat) in a large bowl;
    season with salt. Add noodles and toss to coat. Top with scallion
    greens and drizzle with more chili oil.
 
** Chicken Paprikish
*** Ingredients
    - 1 Yellow Onion
    - 1 Red Pepper
    - 1/4 Cup Hungarian Sweet Paprika
    - 1 Bay Leaf
    - 1 Cup Chicken Stock
    - 4 Chicken Legs
    - 1/2 Sour Cream
    - Dill
*** Prep
    Slice onions and bell peppers into medium sized slivers. Split
    chicken legs into thighs and drumsticks.
*** Instructions
    Season chicken on all sides with salt and pepper. Heat a small
    amount of high-smokepoint oil in a pan over medium heat. Once the
    oil is hot, add the chicken pieces skin side down and cook without
    disturbing for about 8 minutes. Flip over and cook until the other
    side for about 2 minutes. Move chicken to a plate, and remove all
    but a small amount of fat from the pan.

    Saute onions and red peppers on medium heat for about 7 minutes.
    Add the paprika and cook while stirring rapidly, making sure not
    to let the paprika burn, for 1 minute. Add the stock, and scrape
    up anything stuck to the bottom of the pan. Add the bay leaf, then
    place the chicken in a single layer into the pan, skin side up.

    Place the heat on low, and cover the pan and cook until the
    chicken is tender all the way through, which ought to take about
    30 minutes.

    Once the chicken is cooked, remove it, and add the sour cream into
    the sauce. Stir until it is mixed thoroughly, then readd the
    chicken back in the sauce, turning to coat.

    When serving, garnish with extra sour cream and minced dill.
** Oyakodon
*** Ingredients
    - 1 Cup [[*Dashi][Dashi]]
    - 1 Tbsp Soy Sauce
    - 2 Tbsp Sake
    - 1 Tbsp Sugar
    - 1 Large Onion
    - 340 grams Chicken Thighs
    - 3 Green Onions
    - 4 Eggs
*** Prep
    Slice onions into slivers. Slice Scalions, and divide into 2 piles.
    Thinly slice chicken
