recipes/recipes.html
<div id="outline-container-org14dd1bd" class="outline-4">
<h4 id="org14dd1bd"><span class="section-number-4">5.2.2</span> Prep</h4>
<div class="outline-text-4" id="text-5-2-2">
<ul class="org-ul">
<li>Slice Onion</li>
<li>Grate Carrot</li>
<li>Slice Cucumber on bias</li>
<li>Slice Green Onions on bias</li>
<li>Slice Mushrooms in half, then crosswise.</li>
</ul>
</div>
</div>
<div id="outline-container-org5591a1f" class="outline-4">
<h4 id="org5591a1f"><span class="section-number-4">5.2.3</span> Instructions</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
First, begin by preparing the Mushroom Marinade. Mix together the
Gochujang, Soy Sauce, Rice Vinegar, and Water. Add mushrooms to marinade.
Mix till all the mushrooms are coated, and let stand for 10 minutes.
</p>

<p>
Mix together 1Tbsp Rice vinegar, 1 Tsp sugar, and a sprinkle of
salt. Add cucumber and let stand, occasionally mixing.
</p>

<p>
Heat pan with a smal amount of oil on medium-high. Add onions and let cook
until translucent. Add mushrooms and marinade then cook till sauce
is somewhat reduced, about 7-9 minutes.
</p>

<p>
Prepare rice bowls by laying down rice, adding mushroom/onions,
then cucumbers, then carrots. Sprinkle with green onion and sesame seeds.
</p>
</div>
</div>
</div>

<div id="outline-container-orga28db57" class="outline-3">
<h3 id="orga28db57"><span class="section-number-3">5.3</span> Sesame Noodles</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-orgd850936" class="outline-4">
<h4 id="orgd850936"><span class="section-number-4">5.3.1</span> Ingredients</h4>
<div class="outline-text-4" id="text-5-3-1">
<ul class="org-ul">
<li>4 scallions, whites and greens separated, thinly sliced</li>
<li>1/2 cup vegetable oil</li>
<li>1 tablespoon crushed red pepper flakes</li>
<li>2 teaspoons sesame seeds</li>
<li>2 teaspoons Sichuan pepper, coarsely chopped</li>
<li>12 ounces thin noodles</li>
<li>Kosher salt</li>
<li>1/4 cup tahini (sesame seed paste)</li>
<li>1/4 cup unseasoned rice vinegar</li>
<li>3 tablespoons soy sauce</li>
<li>2 teaspoons toasted sesame oil</li>
<li>1 teaspoon sugar</li>
</ul>
</div>
</div>
<div id="outline-container-org856348c" class="outline-4">
<h4 id="org856348c"><span class="section-number-4">5.3.2</span> Instructions</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
Cook scallion whites, vegetable oil, red pepper flakes, sesame
seeds, and pepper in a small saucepan over low heat, stirring
occasionally, until oil is sizzling and scallions are golden
brown, 12–15 minutes; let chili oil cool in saucepan.
</p>

<p>
Meanwhile, cook noodles in a large pot of salted boiling water
until al dente; drain. Rinse under cold water and drain well.
</p>

<p>
Whisk tahini, vinegar, soy sauce, sesame oil, sugar, and 2–3
tablespoons chili oil (depending on desired heat) in a large bowl;
season with salt. Add noodles and toss to coat. Top with scallion
greens and drizzle with more chili oil.
</p>
</div>
</div>
</div>

<div id="outline-container-org8dcc556" class="outline-3">
<h3 id="org8dcc556"><span class="section-number-3">5.4</span> Chicken Paprikish</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-org1040875" class="outline-4">
<h4 id="org1040875"><span class="section-number-4">5.4.1</span> Ingredients</h4>
<div class="outline-text-4" id="text-5-4-1">
<ul class="org-ul">
<li>1 Yellow Onion</li>
<li>1 Red Pepper</li>
<li>1/4 Cup Hungarian Sweet Paprika</li>
<li>1 Bay Leaf</li>
<li>1 Cup Chicken Stock</li>
<li>4 Chicken Legs</li>
<li>1/2 Sour Cream</li>
<li>Dill</li>
</ul>
</div>
</div>
<div id="outline-container-orge060333" class="outline-4">
<h4 id="orge060333"><span class="section-number-4">5.4.2</span> Prep</h4>
<div class="outline-text-4" id="text-5-4-2">
<p>
Slice onions and bell peppers into medium sized slivers. Split
chicken legs into thighs and drumsticks.
</p>
</div>
</div>
<div id="outline-container-org9bfe4ce" class="outline-4">
<h4 id="org9bfe4ce"><span class="section-number-4">5.4.3</span> Instructions</h4>
<div class="outline-text-4" id="text-5-4-3">
<p>
Season chicken on all sides with salt and pepper. Heat a small
amount of high-smokepoint oil in a pan over medium heat. Once the
oil is hot, add the chicken pieces skin side down and cook without
disturbing for about 8 minutes. Flip over and cook until the other
side for about 2 minutes. Move chicken to a plate, and remove all
but a small amount of fat from the pan.
</p>

<p>
Saute onions and red peppers on medium heat for about 7 minutes.
Add the paprika and cook while stirring rapidly, making sure not
to let the paprika burn, for 1 minute. Add the stock, and scrape
up anything stuck to the bottom of the pan. Add the bay leaf, then
place the chicken in a single layer into the pan, skin side up.
</p>

<p>
Place the heat on low, and cover the pan and cook until the
chicken is tender all the way through, which ought to take about
30 minutes.
</p>

<p>
Once the chicken is cooked, remove it, and add the sour cream into
the sauce. Stir until it is mixed thoroughly, then readd the
chicken back in the sauce, turning to coat.
</p>

<p>
When serving, garnish with extra sour cream and minced dill.
</p>
</div>
</div>
</div>
<div id="outline-container-org905ca14" class="outline-3">
<h3 id="org905ca14"><span class="section-number-3">5.5</span> Oyakodon</h3>
<div class="outline-text-3" id="text-5-5">
</div>
<div id="outline-container-org9db6526" class="outline-4">
<h4 id="org9db6526"><span class="section-number-4">5.5.1</span> Ingredients</h4>
<div class="outline-text-4" id="text-5-5-1">
<ul class="org-ul">
<li>1 Cup <a href="#org6c22923">Dashi</a></li>
<li>1 Tbsp Soy Sauce</li>
<li>2 Tbsp Sake</li>
<li>1 Tbsp Sugar</li>
<li>1 Large Onion</li>
<li>340 grams Chicken Thighs</li>
<li>3 Green Onions</li>
<li>4 Eggs</li>
</ul>
</div>
</div>
<div id="outline-container-orgf9e89a9" class="outline-4">
<h4 id="orgf9e89a9"><span class="section-number-4">5.5.2</span> Prep</h4>
<div class="outline-text-4" id="text-5-5-2">
<p>
Slice onions into slivers. Slice Scalions, and divide into 2 piles.
Thinly slice chicken
</p>
</div>
</div>
