recipes/recipes.tex
\subsubsection{Prep}
\label{sec:org59aa65f}
\begin{itemize}
\item Slice Onion
\item Grate Carrot
\item Slice Cucumber on bias
\item Slice Green Onions on bias
\item Slice Mushrooms in half, then crosswise.
\end{itemize}
\subsubsection{Instructions}
\label{sec:orga21e61b}
First, begin by preparing the Mushroom Marinade. Mix together the
Gochujang, Soy Sauce, Rice Vinegar, and Water. Add mushrooms to marinade.
Mix till all the mushrooms are coated, and let stand for 10 minutes.

Mix together 1Tbsp Rice vinegar, 1 Tsp sugar, and a sprinkle of
salt. Add cucumber and let stand, occasionally mixing.

Heat pan with a smal amount of oil on medium-high. Add onions and let cook
until translucent. Add mushrooms and marinade then cook till sauce
is somewhat reduced, about 7-9 minutes.

Prepare rice bowls by laying down rice, adding mushroom/onions,
then cucumbers, then carrots. Sprinkle with green onion and sesame seeds.

\subsection{Sesame Noodles}
\label{sec:orgd71dade}
\subsubsection{Ingredients}
\label{sec:orgb0e87d7}
\begin{itemize}
\item 4 scallions, whites and greens separated, thinly sliced
\item 1/2 cup vegetable oil
\item 1 tablespoon crushed red pepper flakes
\item 2 teaspoons sesame seeds
\item 2 teaspoons Sichuan pepper, coarsely chopped
\item 12 ounces thin noodles
\item Kosher salt
\item 1/4 cup tahini (sesame seed paste)
\item 1/4 cup unseasoned rice vinegar
\item 3 tablespoons soy sauce
\item 2 teaspoons toasted sesame oil
\item 1 teaspoon sugar
\end{itemize}
\subsubsection{Instructions}
\label{sec:org5522268}
Cook scallion whites, vegetable oil, red pepper flakes, sesame
seeds, and pepper in a small saucepan over low heat, stirring
occasionally, until oil is sizzling and scallions are golden
brown, 12–15 minutes; let chili oil cool in saucepan.

Meanwhile, cook noodles in a large pot of salted boiling water
until al dente; drain. Rinse under cold water and drain well.

Whisk tahini, vinegar, soy sauce, sesame oil, sugar, and 2–3
tablespoons chili oil (depending on desired heat) in a large bowl;
season with salt. Add noodles and toss to coat. Top with scallion
greens and drizzle with more chili oil.

\subsection{Chicken Paprikish}
\label{sec:orgc20ee7d}
\subsubsection{Ingredients}
\label{sec:orgfcc972c}
\begin{itemize}
\item 1 Yellow Onion
\item 1 Red Pepper
\item 1/4 Cup Hungarian Sweet Paprika
\item 1 Bay Leaf
\item 1 Cup Chicken Stock
\item 4 Chicken Legs
\item 1/2 Sour Cream
\item Dill
\end{itemize}
\subsubsection{Prep}
\label{sec:orgb72bbf3}
Slice onions and bell peppers into medium sized slivers. Split
chicken legs into thighs and drumsticks.
\subsubsection{Instructions}
\label{sec:org3d1ff3d}
Season chicken on all sides with salt and pepper. Heat a small
amount of high-smokepoint oil in a pan over medium heat. Once the
oil is hot, add the chicken pieces skin side down and cook without
disturbing for about 8 minutes. Flip over and cook until the other
side for about 2 minutes. Move chicken to a plate, and remove all
but a small amount of fat from the pan.

Saute onions and red peppers on medium heat for about 7 minutes.
Add the paprika and cook while stirring rapidly, making sure not
to let the paprika burn, for 1 minute. Add the stock, and scrape
up anything stuck to the bottom of the pan. Add the bay leaf, then
place the chicken in a single layer into the pan, skin side up.

Place the heat on low, and cover the pan and cook until the
chicken is tender all the way through, which ought to take about
30 minutes.

Once the chicken is cooked, remove it, and add the sour cream into
the sauce. Stir until it is mixed thoroughly, then readd the
chicken back in the sauce, turning to coat.

When serving, garnish with extra sour cream and minced dill.
\subsection{Oyakodon}
\label{sec:org5b58547}
\subsubsection{Ingredients}
\label{sec:orgb67a099}
\begin{itemize}
\item 1 Cup \hyperref[sec:org1e7046f]{Dashi}
\item 1 Tbsp Soy Sauce
\item 2 Tbsp Sake
\item 1 Tbsp Sugar
\item 1 Large Onion
\item 340 grams Chicken Thighs
\item 3 Green Onions
\item 4 Eggs
\end{itemize}
\subsubsection{Prep}
\label{sec:org1795e81}
Slice onions into slivers. Slice Scalions, and divide into 2 piles.
Thinly slice chicken
