recipes/recipes.html
<div id="outline-container-org2034b31" class="outline-4">
<h4 id="org2034b31"><span class="section-number-4">5.5.3</span> Instructions</h4>
<div class="outline-text-4" id="text-5-5-3">
<p>
Combine Dashi, Soy Sauce, Sake, and sugar in a saucepan and bring
to a simmer over high heat. Stir in onion and cook until the
onion is just barely tender, about 5 minutes. Add chicken slices
and cook, stirring occasionally. Continue until chichken is cooked
through, about 6 minutes. Stir in half of the green onions, and
season the broth with soy sauce and sugar to taste.
</p>

<p>
Reduce heat, maintaining a bare simmer. Beat eggs in a medium
bowl, and slowly pour the eggs into the pot in a thin, steady
stream, using chopsticks to control the flow. Cover and cook until
the eggs are cooked to your liking, which should be in the 1-3
minute range.
</p>

<p>
To serve, place cooked rice in bowls, and top with egg and chicken
mixture, adding any extra broth to the rice. Garnish with the
remaining green onions.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org3923ca2" class="outline-2">
<h2 id="org3923ca2"><span class="section-number-2">6</span> Baking</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org7db56bd" class="outline-3">
<h3 id="org7db56bd"><span class="section-number-3">6.1</span> Overnight White Bread</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>White Flour (500g)</li>
<li>Kosher Salt (14 g)</li>
<li>Yeast (1/4 Tsp)</li>
</ul>
</div>
<div id="outline-container-orgbef2573" class="outline-4">
<h4 id="orgbef2573"><span class="section-number-4">6.1.1</span> Instructions</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
Mix together flour and 390 grams of warm water in a bowl until no
dry flour remains, and let stand covered with a cloth for 30 minutes.
</p>

<p>
Next, add the salt and yeast and fold until incorporated. Then,
gently fold the dough in half 4 or 5 times, or until the dough
becomes harder to work. Let rest for 30 minutes, and repeat this
folding process 3 more times, waiting 30 minutes between each.
</p>

<p>
Once the folds are complete, let the dough sit overnight covered
by a towel (roughly 8 to 12 hours).
</p>

<p>
Once this bulk rise has completed, turn the dough onto an
<span class="underline">unfloured</span> work surface. Working quickly, grab the right hand
side of the bread, and fold 2/3ds of the way over. Then, grab the
left hand side, and do the same. Next, grab the back side of the
bread and fold over as well. Now, roll the dough towards you until
the seam is on the bottom. Now, take the dough in both hands and
rotate it around to form a ball, making sure not to lift it from
the work surface. Once the outer skin of the dough has built up
sufficient tension, dust the top with flour until it is no longer
tacky, and place in a bowl lined with a towel, floured side down.
</p>

<p>
Let the dough rest for about 45 minutes. In the mean time, place a
dutch oven in the oven at 475 degrees, and let it heat up. When
the resting period is done, quickly turn out the dough onto a
piece of parchment paper. Score the top using a sharp knife, and
then lift the parchment paper into the hot dutch oven. Cover and
let bake for 20 minutes. Once the 20 minutes is up, uncover and
let bake until the top is a rich brown. Remove, and let cool.
</p>
</div>
</div>
</div>
<div id="outline-container-org9e89eba" class="outline-3">
<h3 id="org9e89eba"><span class="section-number-3">6.2</span> Sourdough Starter</h3>
<div class="outline-text-3" id="text-6-2">
<p>
To start, mix together a 50/50 blend of whole wheat and white
flour. Then add warm water slowly and mix, until you reach a batter
like consistency. Leave in a warm, dark place covered with a paper towel
for 3 days, checking every day. Around the third day, the starter
should start to smell a bit funky and fruity, and should have grown
in size or formed bubbles.
</p>

<p>
Once you have cultivated your starter, it is quite easy to use,
feed, and maintain it. To use, discard all but one tablespoon of
the starter, and feed again with a 50/50 blend of whole wheat and
white flour and water, getting it to a batter like consistency.
Let this develop for 24 hours. You will know it is ready when it
floats when placed in water.
</p>

<p>
For the overnight white loaf, I like to use about 100 grams of
starter, and reduce the water to about 370 grams.
</p>

<p>
Starter is easiest to work with when you get into a rythm, as
discarded starter will be used in a loaf of bread, and you can feed
at the same time as making the dough to be ready for the next day.
However, baking a loaf of bread every day is a big ask, and not
always realistic! In these cases, you can put the starter in a
sealed jar in the fridge to make it go dormant. Just make sure to
check on it every once and a while to make sure it doesn't dry out.
</p>
</div>
</div>

<div id="outline-container-org780ee2b" class="outline-3">
<h3 id="org780ee2b"><span class="section-number-3">6.3</span> Japanese Milk Bread</h3>
<div class="outline-text-3" id="text-6-3">
</div>
<div id="outline-container-orgbcfeeb6" class="outline-4">
<h4 id="orgbcfeeb6"><span class="section-number-4">6.3.1</span> Ingredients</h4>
<div class="outline-text-4" id="text-6-3-1">
</div>
<ol class="org-ol">
<li><a id="orgac14d0e"></a>Roux<br />
<div class="outline-text-5" id="text-6-3-1-1">
<ul class="org-ul">
<li>20 grams flour</li>
<li>100 grams water</li>
</ul>
</div>
</li>
<li><a id="orgfdd9961"></a>Dough<br />
<div class="outline-text-5" id="text-6-3-1-2">
<ul class="org-ul">
<li>330 grams flour</li>
<li>24 grams sugar</li>
<li>14 grams powdered milk</li>
<li>7 grams salt</li>
<li>4 grams instant yeast</li>
<li>95 grams warm water</li>
<li>1 egg</li>
<li>20 grams butter</li>
</ul>
</div>
</li>
</ol>
</div>
