recipes/recipes.tex
\subsubsection{Instructions}
\label{sec:org7d7e3fb}
Combine Dashi, Soy Sauce, Sake, and sugar in a saucepan and bring
to a simmer over high heat. Stir in onion and cook until the
onion is just barely tender, about 5 minutes. Add chicken slices
and cook, stirring occasionally. Continue until chichken is cooked
through, about 6 minutes. Stir in half of the green onions, and
season the broth with soy sauce and sugar to taste.

Reduce heat, maintaining a bare simmer. Beat eggs in a medium
bowl, and slowly pour the eggs into the pot in a thin, steady
stream, using chopsticks to control the flow. Cover and cook until
the eggs are cooked to your liking, which should be in the 1-3
minute range.

To serve, place cooked rice in bowls, and top with egg and chicken
mixture, adding any extra broth to the rice. Garnish with the
remaining green onions.
\section{Baking}
\label{sec:orgf8b2e15}
\subsection{Overnight White Bread}
\label{sec:orgd8daee8}
\begin{itemize}
\item White Flour (500g)
\item Kosher Salt (14 g)
\item Yeast (1/4 Tsp)
\end{itemize}
\subsubsection{Instructions}
\label{sec:orga19094e}
Mix together flour and 390 grams of warm water in a bowl until no
dry flour remains, and let stand covered with a cloth for 30 minutes.

Next, add the salt and yeast and fold until incorporated. Then,
gently fold the dough in half 4 or 5 times, or until the dough
becomes harder to work. Let rest for 30 minutes, and repeat this
folding process 3 more times, waiting 30 minutes between each.

Once the folds are complete, let the dough sit overnight covered
by a towel (roughly 8 to 12 hours).

Once this bulk rise has completed, turn the dough onto an
\uline{unfloured} work surface. Working quickly, grab the right hand
side of the bread, and fold 2/3ds of the way over. Then, grab the
left hand side, and do the same. Next, grab the back side of the
bread and fold over as well. Now, roll the dough towards you until
the seam is on the bottom. Now, take the dough in both hands and
rotate it around to form a ball, making sure not to lift it from
the work surface. Once the outer skin of the dough has built up
sufficient tension, dust the top with flour until it is no longer
tacky, and place in a bowl lined with a towel, floured side down.

Let the dough rest for about 45 minutes. In the mean time, place a
dutch oven in the oven at 475 degrees, and let it heat up. When
the resting period is done, quickly turn out the dough onto a
piece of parchment paper. Score the top using a sharp knife, and
then lift the parchment paper into the hot dutch oven. Cover and
let bake for 20 minutes. Once the 20 minutes is up, uncover and
let bake until the top is a rich brown. Remove, and let cool.
\subsection{Sourdough Starter}
\label{sec:org3e6f48c}
To start, mix together a 50/50 blend of whole wheat and white
flour. Then add warm water slowly and mix, until you reach a batter
like consistency. Leave in a warm, dark place covered with a paper towel
for 3 days, checking every day. Around the third day, the starter
should start to smell a bit funky and fruity, and should have grown
in size or formed bubbles.

Once you have cultivated your starter, it is quite easy to use,
feed, and maintain it. To use, discard all but one tablespoon of
the starter, and feed again with a 50/50 blend of whole wheat and
white flour and water, getting it to a batter like consistency.
Let this develop for 24 hours. You will know it is ready when it
floats when placed in water.

For the overnight white loaf, I like to use about 100 grams of
starter, and reduce the water to about 370 grams.

Starter is easiest to work with when you get into a rythm, as
discarded starter will be used in a loaf of bread, and you can feed
at the same time as making the dough to be ready for the next day.
However, baking a loaf of bread every day is a big ask, and not
always realistic! In these cases, you can put the starter in a
sealed jar in the fridge to make it go dormant. Just make sure to
check on it every once and a while to make sure it doesn't dry out.

\subsection{Japanese Milk Bread}
\label{sec:org2efd08a}
\subsubsection{Ingredients}
\label{sec:org83cc391}
\begin{enumerate}
\item Roux
\label{sec:org14502da}
\begin{itemize}
\item 20 grams flour
\item 100 grams water
\end{itemize}
\item Dough
\label{sec:org3d9225a}
\begin{itemize}
\item 330 grams flour
\item 24 grams sugar
\item 14 grams powdered milk
\item 7 grams salt
\item 4 grams instant yeast
\item 95 grams warm water
\item 1 egg
\item 20 grams butter
\end{itemize}
\end{enumerate}
