recipes/recipes.html
<div id="outline-container-orga301c03" class="outline-4">
<h4 id="orga301c03"><span class="section-number-4">6.3.2</span> Instructions</h4>
<div class="outline-text-4" id="text-6-3-2">
<p>
First, mix together all the dry ingredients from the <b>Dough</b>
section. Then, proceed to make the roux by whisking the flour into
the water in a small pot. Heat on medium low, stirring
continuously. It is done when pulling a spatula through it allows
you to see the bottom.
</p>

<p>
Add all the water, egg, and roux to the dry ingredient
mixture. Mix, then knead until the dough comes together. Then,
slowly incorporate the butter while kneading, until the dough is
slightly tacky. Shape the dough into a ball, then place in a
greased bowl.
</p>

<p>
Cover the dough, and let rise for about an hour, or until it has
roughly doubled in size. Punch down the dough, divide into halves,
and reshape into balls. Let the dough rest again for 20 minutes on
the counter.
</p>

<p>
Roll out each ball into an elongated elipse, and fold into thirds lengthwise.
Roll out the dough again in the same manner, then roll the dough
up into a log.
</p>

<p>
Place both rolls in a loaf pan with the seam facing down. Let
the dough proof, until it has filled up the pan. Bake at 350F for
35 minutes. Remove from the pan and let cool on a rack.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Reed Mullanix</p>
<p class="date">Created: 2021-02-07 Sun 11:04</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
