recipes/recipes.tex
\subsubsection{Instructions}
\label{sec:org72b8a59}
First, mix together all the dry ingredients from the \textbf{Dough}
section. Then, proceed to make the roux by whisking the flour into
the water in a small pot. Heat on medium low, stirring
continuously. It is done when pulling a spatula through it allows
you to see the bottom.

Add all the water, egg, and roux to the dry ingredient
mixture. Mix, then knead until the dough comes together. Then,
slowly incorporate the butter while kneading, until the dough is
slightly tacky. Shape the dough into a ball, then place in a
greased bowl.

Cover the dough, and let rise for about an hour, or until it has
roughly doubled in size. Punch down the dough, divide into halves,
and reshape into balls. Let the dough rest again for 20 minutes on
the counter.

Roll out each ball into an elongated elipse, and fold into thirds lengthwise.
Roll out the dough again in the same manner, then roll the dough
up into a log.

Place both rolls in a loaf pan with the seam facing down. Let
the dough proof, until it has filled up the pan. Bake at 350F for
35 minutes. Remove from the pan and let cool on a rack.
\end{document}
